Repository: common-repository/ajax-product-search-woocommerce
Catalog: langs/ajax-product-search-woocommerce-*.po
Languages: pt_br

source: General
pt_br: Geral

source: General Options
pt_br: Opções gerais

source: Enable Plugin
pt_br: Ativar plugin

source: Enable "Ajax Product Search for WooCommerce" plugin
pt_br: Ativa o plugin "Ajax Product Search for WooCommerce"

source: Load Select2
pt_br: Carregar Select2

source: Loads most recent version of <a target="_blank" href="%s">Select2</a>
pt_br: Carrega a versão mais recente do <a target="_blank" href="%s">Select2</a>

source: Mark this only if you are not loading Select2 nowhere else. Select2 is responsible for improving the html select element.
pt_br: Marque essa opção somente se você não estiver carregando o Select2 em nenhum outro lugar. Select2 é responsável por melhorar o elemento select do HTML

source: It is required for this plugin to work. If you are uncertain, please let it enabled.
pt_br: Ele é necessário para esse plugin funcionar. Se você está incerto, por favor deixe a opção ativada

source: Search
pt_br: Busca

source: Enable cache
pt_br: Ativar cache

source: Saves search results in a transient
pt_br: Salva os resultados da busca no cache

source: It helps improving search speed in high traffic sites
pt_br: Ajuda a melhorar o resultado de busca nos sites com muitos acessos

source: Cache timeout
pt_br: Tempo de esgotamento do cache

source: The amount of time results will be stored in transient (in hours)
pt_br: A quantidade de tempo que os resultados serão guardados no cache (em horas)

source: Texts
pt_br: Textos

source: Text Options
pt_br: Opções de texto

source: Input too short
pt_br: Caracteres insuficientes

source: Text displayed when input is not long enough to start searching
pt_br: Texto apresentado quando o input não tem caracteres suficientes para a busca começar

source: %d is going to be replaced by the amount of characters missing to start searching
pt_br: %d será substituído pela quantidade de caracteres que estão faltando para a busca começar

source: Please enter %d or more characters
pt_br: Por favor, digite %d ou mais caracteres

source: Input too long
pt_br: Caracteres em excesso

source: Text displayed when input exceeded the maximum characters allowed
pt_br: Texto exibido quando o input excedeu a quantidade máxima de caracteres permitida

source: Please delete %d or more characters
pt_br: Por favor, delete %d ou mais caracteres

source: Error loading
pt_br: Erro de carregamento

source: Text displayed when some error occurs
pt_br: Texto exibido quando surge um erro

source: Error loading results
pt_br: Erro carregando resultados

source: Loading more
pt_br: Carregando mais

source: Text displayed when there are more results to be loaded
pt_br: Texto exibido quando há mais resultados a serem carregados

source: Loading more...
pt_br: Carregando mais...

source: View all results
pt_br: Ver todos os resultados

source: Text displayed with a link pointing to a page showing all search results
pt_br: Texto exibido com um link apontando para uma página mostrando todos os resultados da busca

source: %d is going to be replaced by search results amount
pt_br: %d será substituído pelo total dos resultados da busca

source: View all results (%d)
pt_br: Ver resultados (%d)

source: No results
pt_br: Sem resultados

source: Text displayed when there are no found results
pt_br: Texto exibido quando não há resultados encontrados

source: No results found
pt_br: Nenhum resultado encontrado

source: Loading
pt_br: Carregando

source: Text displayed when products are being searched
pt_br: Texto exibido quando os produtos estão sendo buscados

source: Loading...
pt_br: Carregando...

source: Settings
pt_br: Ajustes

source: Search products
pt_br: Buscar produtos

source: An input that searches WooCommerce products using an autocomplete feature
pt_br: Um input que busca produtos do WooCommerce usando o recurso de Autocomplete
